Nets/nets1.org
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{esint}
#+LATEX_HEADER:\usepackage[english,russian]{babel}
#+LATEX_HEADER:\usepackage{mathtools}
#+LATEX_HEADER:\usepackage{amsthm}
#+OPTIONS: toc:nil
#+LATEX_HEADER:\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}

Прикладной уровень: \\
FTP: передача файлов. DNS: distributed hash table for mapping Domain name -> IP. \\
SMTP: sending mail. В пакете содержатся DNS имена отправителя и получателя. \\
HTTP. Skype. Relay-servers for p2p-connections. BitTorrent. \\
Модель TCP: упорядоченный поток байт. \\

Формула Литтла:
#+BEGIN_EXPORT latex
\begin{equation}
\begin{cases}
\lambda(T) = \frac{N(T)}{T}, \\
D(T) = \frac{A(T)}{N(T)}, \\
L(T) = \frac{A(T)}T,
\end{cases}
\end{equation}
где $N(T)$ - число заявок в системе, $A(T)$ - время нахождения заявок в системе, $\lambda(T)$ - среднее число заявок, $D(T)$ - среднее время заявки в системе, $L(T)$ - средняя длина очереди.

Формула верна независимо от распределения, если \textbf{заявки не теряются}.

Предположим, что пакеты приходят по Пуассону, а уходят экспоненциально, тогда $L = \frac{\mu}{|\mu - \lambda|}$
#+END_EXPORT
