Nets/nets1.tex
% Created 2019-09-26 Thu 16:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath}
\usepackage{esint}
\usepackage[english, russian]{babel}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}
\author{Sergey Makarov}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Sergey Makarov},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

Прикладной уровень: \\
FTP: передача файлов. DNS: distributed hash table for mapping Domain name -> IP. \\
SMTP: sending mail. В пакете содержатся DNS имена отправителя и получателя. \\
HTTP. Skype. Relay-servers for p2p-connections. BitTorrent. \\
Модель TCP: упорядоченный поток байт. \\

Формула Литтла:
\begin{equation}
\begin{cases}
\lambda(T) = \frac{N(T)}{T}, \\
D(T) = \frac{A(T)}{N(T)}, \\
L(T) = \frac{A(T)}T,
\end{cases}
\end{equation}
где $N(T)$ - число заявок в системе, $A(T)$ - время нахождения заявок в системе, $\lambda(T)$ - среднее число заявок, $D(T)$ - среднее время заявки в системе, $L(T)$ - средняя длина очереди.

Формула верна независимо от распределения, если \textbf{заявки не теряются}.

Предположим, что пакеты приходят по Пуассону, а уходят экспоненциально, тогда $L = \frac{\mu}{|\mu - \lambda|}$
\end{document}
